[
  {
    "versionName": "0.4.4",
    "releaseDate": "23/06/2021",
    "features": [
    ],
    "fixes": [
      "Fixed an issue where upgrade was not recognised, under certain conditions"
    ],
    "improvements": [
      "Translation updates (work in progress)"
    ],
    "notes": [
      "S2 is now free to use for 2 weeks. There are options to upgrade in the app. I'd like to tweak prices so they make sense in your country. Please come and discuss this on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.4.3",
    "releaseDate": "22/06/2021",
    "features": [
    ],
    "fixes": [
      "Don't split artists by '/' character (AC/DC no longer splits into AC, DC)",
      "Fixed an issue where album didn't remain expanded in the artist detail view, after playing a song",
      "Fixed an issue where tag editor success and failure messages were inverted (displayed 'failed to update tags', when it actually succeeded)"
    ],
    "improvements": [
      "Increased the timeout for Jellyfin & Emby when requesting data ('scanning'), from 30 seconds to 90 seconds",
      "Ensure more phrases are translated (work in progress)"
    ],
    "notes": [
      "S2 is now free to use for 2 weeks. There are options to upgrade in the app. I'd like to tweak prices so they make sense in your country. Please come and discuss this on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.4.2",
    "releaseDate": "16/06/2021",
    "features": [
    ],
    "fixes": [
      "Fixed a translation related crash for some users"
    ],
    "improvements": [
      "Translation updates"
    ],
    "notes": [
      "If you'd like to help translate S2 into another language, or you notice an error in the translations, please visit https://shuttle.oneskyapp.com/collaboration/project?id=382482"
    ]
  },
  {
    "versionName": "0.4.1",
    "releaseDate": "15/06/2021",
    "features": [
    ],
    "fixes": [
      "Fixed an issue where Sleep Timer '5 minutes' option actually timed out after 1 minute",
      "Fixed an issue where artists didn't show up in Android Auto",
      "Fixed an issue where Android Auto playback would start from track 1, instead of selected track"
    ],
    "improvements": [
      "Translation updates"
    ],
    "notes": [
      "If you'd like to help translate S2 into another language, or you notice an error in the translations, please visit https://shuttle.oneskyapp.com/collaboration/project?id=382482"
    ]
  },
  {
    "versionName": "0.4.0",
    "releaseDate": "11/06/2021",
    "features": [
      "Translations! French, Spanish (Spain, Latin America), Japanese, Portuguese (Portugal, Brazil), Italian, Russian, Polish, Dutch, German, Hindi. Please get in touch if you find any errors in the translations!"
    ],
    "fixes": [
      "Fixed an issue with Jellyfin/Emby artist artwork loading",
      "Fixed an issue where MediaStore playlist import re-added existing songs",
      "Fixed an issue where artist/album detail screens incorrectly displayed the small placeholder image",
      "Fixed an issue where playlists were missing from 'add to playlist' menu on some screens",
      "Fixed an issue where the notification didn't show placeholder artwork, which meant the seekbar was not visible on some devices"
    ],
    "improvements": [
      "Fixed a major performance issue, introduced in 0.3.0",
      "Use 'unknown' instead of displaying blank text in more places",
      "Unknown (blank) artists/albums/songs are now moved to the bottom of the list when sorting",
      "Search: Show artist name or album-artist name"
    ],
    "notes": [
      "If you'd like to help translate S2 into another language, or you notice an error in the translations, please let me know, or visit https://shuttle.oneskyapp.com/collaboration/project?id=382482"
    ]
  },
  {
    "versionName": "0.3.81",
    "releaseDate": "09/06/2021",
    "features": [
      "Added ability to sort playlist contents"
    ],
    "fixes": [
      "Fixed a formatting issue causing various text fields to show blank text, instead of artist, album-artist, album or 'unknown'",
      "Fixed an issue where the sort order could vary depending on the previously selected sort order",
      "Fixed an issue where incorrect selected sort order was displayed",
      "Fixed an issue where 'recently played' was sorted by album year",
      "When removing a media provider, the associated songs are removed from the queue"
    ],
    "improvements": [
      "'Something Different' list no longer changes every time the screen is refreshed"
    ],
    "notes": [
      "S2 will soon be free to try for 2 weeks. As always, feel free to get in touch via Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.80",
    "releaseDate": "04/06/2021",
    "features": [],
    "fixes": [
      "Fixed a crash when scanning media"
    ],
    "improvements": [
      "Show blank instead of 'null' for tracks with unknown track number"
    ],
    "notes": [
      "S2 will soon be free to try for 2 weeks. As always, feel free to get in touch via Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.7",
    "releaseDate": "04/06/2021",
    "features": [],
    "fixes": [
      "Fixed an issue where the queue could not be scrolled after rearranging a queue item, and other conditions",
      "Fixed a crash when attempting to display a song with no artist or album artist",
      "Fixed potential crashes when displaying bullet-separated items, where the text is blank",
      "Use DP instead of PX when rounding corners of artwork"
    ],
    "improvements": [
      "Improved lyrics contrast (background is darker)",
      "Don't log the currently playing song's path, as this may include sensitive information (host/path/api key) for Jellyfin/Emby. Note: these were only visible when copying debug logs or connecting to the phone via adb",
      "Increase priority of playback notification - may fix issue where notification hides in notification tray on some devices"
    ],
    "notes": [
      "S2 will soon be free to try for 2 weeks. As always, feel free to get in touch via Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.6",
    "releaseDate": "01/06/2021",
    "features": [],
    "fixes": [
      "Crash fix"
    ],
    "improvements": [
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.5",
    "releaseDate": "31/05/2021",
    "features": [],
    "fixes": [
      "Possible fix for notification hiding in notification shade, for some devices",
      "Fixed a crash when attempting to view song info for songs with special characters in file path",
      "Fixed an issue where rescanning didn't detect file changes unless the directory selection screen was shown",
      "Fixed an issue preventing songs from being added to playlists",
      "Fixed an issue preventing duplicates from being detected when adding songs to playlists"
    ],
    "improvements": [
      "Various fuzzy search improvements. Results should be much more accurate now",
      "Settings - Rescan now shows more detailed scan progress",
      "Media scanner can now process multiple media providers in parallel",
      "Added option to add queue items to playlists"
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.4",
    "releaseDate": "13/05/2021",
    "features": [],
    "fixes": [
      "Fixed a theming issue (wrong secondary text colour in day/night - night mode"
    ],
    "improvements": [
      "Added support for Jellyfin/Emby disc number",
      "Added support for Vorbis 'YEAR' comment field"
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.3",
    "releaseDate": "13/05/2021",
    "features": [],
    "fixes": [
      "Fixed crash when opening playlist",
      "Fixed crash when adding items to queue",
      "Fixed crash when editing tags",
      "Fixed display issue for theme options"
    ],
    "improvements": [
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.2",
    "releaseDate": "12/05/2021",
    "features": [],
    "fixes": [
      "Fixed an issue capping Jellyfin audio bitrate to 64kb",
      "Fixed a crash when attempting to add items to queue",
      "Fixed a crash when rendering song list, where a song has no album",
      "Fixed an issue where songs with unknown year from Jellyfin media provider would display '0' instead of 'unknown'"
    ],
    "improvements": [
      "Improved layout of album grouping heading"
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.1",
    "releaseDate": "11/05/2021",
    "features": [
      "Added 'play to end of song' option to sleep timer",
      "Added Jellyfin/Emby image loading"
    ],
    "fixes": [
      "Fixed an issue preventing EQ from working with 24-bit audio",
      "Fixed an error preventing songs from loading on song list screen",
      "Fixed issue preventing local artwork from loading"
    ],
    "improvements": [
      "Added support for local 'artwork.[jpg/jpeg/jpg] (must be in same folder as songs)"
    ],
    "notes": [
      "S2 is preparing for an official release! If you have any feedback on how it could be improved, please join the discussion on Discord: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.3.0",
    "releaseDate": "03/05/2021",
    "features": [
      "S2 now loads artwork from a new, custom built dedicated artwork server. Artwork should load more quickly, at a much lower file size than previously",
      "Added support for 'grouping' tag (Shuttle Media Provider only)"
    ],
    "fixes": [
      "Fixed a menu display issue on album detail screen (showing 'shuffle' text)",
      "Fixed an error preventing Shuttle Media Provider from completing scan after encountering problematic files",
      "Fixed an issue where artwork disappeared from the cache after 2 weeks"
    ],
    "improvements": [
      "Migrate from Coil image loader back to Glide. Faster image loading & better caching",
      "Song artwork is now cached independently of album artwork. If artwork is found in the tags or on disk, it will be used anywhere that song is displayed",
      "Added path information to song info dialog"
    ],
    "notes": [
      "S2 is now using a new custom built server for artwork. Artwork will need to be downloaded again"
    ]
  },
  {
    "versionName": "0.2.18",
    "releaseDate": "26/04/2021",
    "features": [
    ],
    "fixes": [
      "Another attempted database migration fix ðŸ™",
      "Fixed lyrics layout issue",
      "Possible fix for notification displaying when it shouldn't"
    ],
    "improvements": [
    ],
    "notes": [
      "If you notice that your library is showing 'null' instead of the artist name, go to settings -> media provider -> scan"
    ]
  },
  {
    "versionName": "0.2.17",
    "releaseDate": "24/04/2021",
    "features": [
    ],
    "fixes": [
      "Another attempted database migration fix",
      "Fixed layout issue on now playing screen",
      "Fixed widget artist name display issue"
    ],
    "improvements": [
    ],
    "notes": [
      "If you notice that your library is showing 'null' instead of the artist name, go to settings -> media provider -> scan"
    ]
  },
  {
    "versionName": "0.2.16",
    "releaseDate": "23/04/2021",
    "features": [
    ],
    "fixes": [
      "Fixed a database migration issue, causing app to load songs, albums, artists, etc. indefinitely & scanner to fail",
      "Fixed a crash when attempting to highlight matched characters in search results",
      "Fixed a crash when returning to app after a while in background"
    ],
    "improvements": [
    ],
    "notes": [
    ]
  },
  {
    "versionName": "0.2.15",
    "releaseDate": "21/04/2021",
    "features": [
      "Artist & Album-Artist are now independent fields, and S2 uses a more intelligent approach to combining songs/albums together based on the artist/album-artist fields",
      "Show artist instead of album-artist in various places",
      "Added support for viewing & editing embedded lyrics (Shuttle Media Provider only)",
      "Searching by artist now scans artist and album-artist tags",
      "Added a settings option to disable lockscreen artwork"
    ],
    "fixes": [
      "Fixed an issue preventing S2 and Chromecast from playing HLS streams from Emby & Jellyfin",
      "Fixed a memory leak when related to the progress bar shown on queue items",
      "Fixed an issue where notification progress wasn't updated when a song ends, in repeat-song mode",
      "Fixed an issue where seekbar would highlight when you tap anywhere on now playing screen"
    ],
    "improvements": [
      "Jellyfin & Emby address and port configuration are now combined, allowing for more liberal combinations of host & port",
      "Search query is no longer saved. When you open search, the field will be empty",
      "Fixed an issue where a song would incorrectly repeat, while the app would display the next song as now playing",
      "Added option to edit tags from now playing screen",
      "Option to clear queue moved from playback screen to queue screen",
      "Edit tags no longer an option for media providers where it's not supported (MediaStore, Jellyfin, Emby)",
      "Disc number is now editable when batch editing tags"
    ],
    "notes": [
      "S2 has a very active community on Discord. If you haven't already, please come and join the conversation: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.2.14",
    "releaseDate": "07/03/2021",
    "features": [
    ],
    "fixes": [
      "Fixed an issue where current time was occasionally blank on now playing screen",
      "Fixed a crash when launching 'frequency response' screen"
    ],
    "improvements": [
      "Additional logging when attempting to restore queue"
    ],
    "notes": [
      "S2 has a very active community on Discord. If you haven't already, please come and join the conversation: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.2.13",
    "releaseDate": "04/03/2021",
    "features": [
      "Search is now fuzzy",
      "Search results can now be filtered to display artists, albums and or songs",
      "Playlists can now be renamed",
      "Duplicates are detected when adding songs to playlist"
    ],
    "fixes": [
    ],
    "improvements": [
      "Added more menu items for playlist list & detail screens (add to queue, rename, clear, delete)",
      "Artist & album name are now displayed on separate lines on the Now Playing screen",
      "Added 'play' option to artist detail screen context menu",
      "The Media Store playlist importer is now more lenient when matching S2 tracks with Media Store tracks",
      "Added an option to preferences to view open source licenses"
    ],
    "notes": [
      "S2 has a very active community on Discord. If you haven't already, please come and join the conversation: https://discord.gg/YkhSuHJ"
    ]
  },
  {
    "versionName": "0.2.12",
    "releaseDate": "26/02/2021",
    "features": [
      "Added support for Replay Gain (read-only)",
      "Added preamp to DSP settings"
    ],
    "fixes": [
      "Fixed an issue preventing the file manager from being launched on Android R"
    ],
    "improvements": [
      "Equalizer now supports 24-bit audio",
      "Optimised queue restoration (queue loads faster when launching app)",
      "Minor change to Chromecast HTTP server.. Now starts & stops in sync with 'CastSession'"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.11",
    "releaseDate": "18/02/2021",
    "features": [],
    "fixes": [
      "Possible fix for mostly-vertical swipes causing horizontal paging",
      "Fixed a performance issue causing excessive garbage collection and resulting in ANRs"
    ],
    "improvements": [
      "Improved changelog",
      "Updated compile sdk to Android 30"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.10",
    "releaseDate": "15/02/2021",
    "features": [],
    "fixes": [
      "Fixed Chromecast issue for remote media providers (untested, please let me know if this works!)",
      "Fixed an issue preventing certain images from being stored in the cache"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.2.9",
    "releaseDate": "13/02/2021",
    "features": [],
    "fixes": [
      "Proper fix for notification progress not updating",
      "Fixed an issue where bluetooth metadata didn't update correctly",
      "Fixed issue where cached images weren't displayed when offline",
      "Various other minor crash fixes",
      "Various optimisations & attempts to reduce ANRs"
    ],
    "improvements": [
      "Send 'audio effect' intents to allow 3rd party DSP effects",
      "Removed the debug drawer (debug logging still available in settings)"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.8",
    "releaseDate": "08/02/2021",
    "features": [
      "Added various theme options"
    ],
    "fixes": [],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.2.7",
    "releaseDate": "25/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue preventing scanner from finding files"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.2.6",
    "releaseDate": "24/01/2021",
    "features": [],
    "fixes": [
      "Possible fix for bluetooth metadata not updating",
      "Fixed an issue where notification was shown without placeholder art",
      "Fixed ~6 unique crashes and potentially resolved a couple of ANRs (application not responding)",
      "Fixed an issue causing slow loading of app when there are lots of tracks in the queue",
      "Possible (unlikely?) fix for assistant not working with S2 - now implements 'MediaSession.onPrepareFromSearch()' API"
    ],
    "improvements": [
      "Prioritise folder artwork over embedded (tag) artwork",
      "Prevent .m3u files from being imported as music by S2 scanner",
      "Remember last selected library tab",
      "Added option to clear queue",
      "Increased Emby & Jellyfin server read timeout (S2 waits longer for a response when asking for song listing during scan)",
      "Fall back to 'original date' if year is missing, when reading tags"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.5",
    "releaseDate": "14/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue preventing Emby scan from completing if item is missing certain required information",
      "Fixed missing artwork placeholder for expandable album image"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.2.4",
    "releaseDate": "14/01/2021",
    "features": [],
    "fixes": [
      "Fixed a crash when attempting to load artwork with wifi off and 'Wi-Fi only' on",
      "Fixed image scaling issue for widgets",
      "Fixed an issue where the wrong song would play next, after enabling shuffle",
      "Fixed an issue where library tabs would stop responding to click events",
      "Partial fix for issue where user can start scan before all of their media directories have been discovered"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.2.3",
    "releaseDate": "13/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue preventing Emby media scan from completing",
      "Fixed a crash when viewing/adding directories to Shuttle scanner",
      "Possible fix for various Application Not Responding (ANR) errors"
    ],
    "improvements": [
      "S2 now scans folders for artwork, under the name folder/cover/album.jpg/jpeg/png (case insensitive)",
      "Minor UI improvements when selecting directories for Shuttle scanner"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.2",
    "releaseDate": "09/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue with Jellyfin track durations",
      "Fixed an issue where Emby tracks were missing year data"
    ],
    "improvements": [
      "Dependency updates"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.1",
    "releaseDate": "08/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue preventing Jellyfin from scanning media",
      "Fixed a crash when attempting to retrieve pictures from tags"
    ],
    "improvements": [
      "Added support for Emby & Jellyfin genres"
    ],
    "notes": []
  },
  {
    "versionName": "0.2.0",
    "releaseDate": "07/01/2021",
    "features": [
      "Added Jellyfin support"
    ],
    "fixes": [
      "Fixed an issue where notification progress would get out of sync after skipping tracks",
      "Fixed an issue preventing Emby from connection to local IP addresses",
      "Fixed an issue where play count was incremented twice when repeat mode is on (thanks @Crusader)",
      "Fixed an issue where most played play count didn't update in real time",
      "Fixed an issue where nothing happened after pressing play after the last song in the queue has completed",
      "Performance optimisations when lists are updated with a large number of items"
    ],
    "improvements": [
      "Artwork no longer flickers when toggling shuffle mode",
      "Don't show play count in 'history' playlist",
      "Moved play count badge to sit on top of artwork image"
    ],
    "notes": []
  },
  {
    "versionName": "0.1.6",
    "releaseDate": "04/01/2021",
    "features": [],
    "fixes": [
      "Fixed another performance issue, possibly causing the app to stop responding",
      "Fixed issue where genre detail screen was blank",
      "Fixed most played & recently played reversed sort order issue"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.1.5",
    "releaseDate": "04/01/2021",
    "features": [],
    "fixes": [
      "Fixed an issue where incorrect song played after rearranging the queue",
      "Fixed an issue where favourites button didn't work on now playing screen",
      "Fixed an issue where you couldn't navigate from home -> favourites playlist more than once"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.1.4",
    "releaseDate": "04/01/2021",
    "features": [],
    "fixes": [
      "Fixed a crash when opening Genre detail screen",
      "Fixed an issue where queue item playback state wasn't updated correctly"
    ],
    "improvements": [
      "Limit MediaSession queue length to 50 items",
      "Prevent long-named song list items from overlapping overflow button"
    ],
    "notes": []
  },
  {
    "versionName": "0.1.3",
    "releaseDate": "03/01/2021",
    "features": [],
    "fixes": [
      "Fixed a crash when attempting to add directories to S2 scanner"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.1.2",
    "releaseDate": "03/01/2021",
    "features": [],
    "fixes": [
      "Performance improvements and bug fixes..",
      "This update aims to resolve a bunch of issues resulting in the app locking up and becoming unresponsive",
      "Resolved several memory leaks, reduced overall memory footprint"
    ],
    "improvements": [
      "Library tabs are now loaded on demand. So you're more likely to see a loading indicator when swiping to, say, the songs list. This reduces the load when the app is starting up, and when returning to the library screen"
    ],
    "notes": []
  },
  {
    "versionName": "0.1.1",
    "releaseDate": "31/12/2020",
    "features": [],
    "fixes": [
      "Fixed a bug where scanner would get stuck saying 'scan failed'",
      "Various optimisations.. attempting to fix lag introduced in 0.1.0"
    ],
    "improvements": [],
    "notes": []
  },
  {
    "versionName": "0.1.0",
    "releaseDate": "28/12/2020",
    "features": [
      "Multi-select artists, albums & songs to add to playlist, queue or edit tags"
    ],
    "fixes": [],
    "improvements": [
      "Minor improvements"
    ],
    "notes": []
  }
]